<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>php-lessons</title>
</head>
<body>
	<h1>PHP - 3. Основы PHP. Ассоциативные массивы.</h1>
<a href="index.php">PHP - Главная страница</a><br><br>		
<a href="lesson-2.php">PHP - 2. Основы PHP. Массивы.</a><br>
<a href="lesson-4.php">PHP - 4. Основы PHP. Функции.</a><br>
<a href="lesson-5.php">PHP - 5. Post и Get запросы.</a>

<h3>Список книг и авторов:</h3><br><br>

<?php

$booksList = array (

"Рей Брэдбeри" => "451° по Фаренгейту",
"Грегори Дэвид Робертс" => "Шантарам",
"Джордж Оруэлл" => "1984",
"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
"Эрих Мария Ремарк" => "Три товарища",
"Оскар Уайльд" => "Портрет Дориана Грея",
"Рей Брэдбери" => "Вино из одуванчиков",
"Даниел Киз" => "Цветы для Элджернона",
"Джером Д. Сэлинджер" => "Над пропастью во ржи",
"Антуан де Сент-Экзюпери" => "Маленький принц",
"Лев Толстой" => "Анна Каренина",
"Габриэль Гарсиа Маркес" => "Сто лет одиночества",
"Грегори Дэвид Робертс" => "Тень горы",
"Айн Рэнд" => "Атлант расправил плечи"
);

foreach ($booksList as $key => $value) {
	echo "$key - $value <br>";
}

?>
</body>
</html>